results/bf16-pd1p1d-tp16x2node-mooncake-efa-low-latency-specon-isl1024-osl1024-c32-n128.log
### tag=bf16-pd1p1d-tp16x2node-mooncake-efa-low-latency-specon-isl1024-osl1024-c32-n128
### endpoint=localhost:8000 image=hy4-preview-efa:latest
### quant=bf16 tp=16 nnodes=2 profile=low-latency spec=on
### topo=pd1p1d-tp16x2node-mooncake-efa gpus=32 backend=mooncake
### moe_a2a=none ep=unknown dp_attn=unknown v2_cap=unknown chunk=unknown
### isl=1024 osl=1024 num_prompts=128 concurrency=32 max_running=unknown
### started=2026-09-09T09:55:59Z
/sgl-workspace/sglang/python/sglang/srt/layers/quantization/awq/awq.py:53: UserWarning: Only CUDA, HIP and XPU support AWQ currently.
  warnings.warn(f"Only CUDA, HIP and XPU support AWQ currently.")
/sgl-workspace/sglang/python/sglang/srt/layers/quantization/gguf.py:69: UserWarning: Only CUDA, MUSA and NPU support GGUF quantization currently.
  warnings.warn(f"Only CUDA, MUSA and NPU support GGUF quantization currently.")
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
  0%|          | 0/128 [00:00<?, ?it/s]benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='localhost', port=8000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='tencent/Hy4-preview', served_model_name=None, tokenizer='/models/Hy4-preview', num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/results/bf16-pd1p1d-tp16x2node-mooncake-efa-low-latency-specon-isl1024-osl1024-c32-n128.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:8000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai', base_url=None, host='localhost', port=8000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='tencent/Hy4-preview', served_model_name=None, tokenizer='/models/Hy4-preview', num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/results/bf16-pd1p1d-tp16x2node-mooncake-efa-low-latency-specon-isl1024-osl1024-c32-n128.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 131072
#Output tokens: 131072
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 128/128 [01:22<00:00,  1.54it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     128       
Benchmark duration (s):                  82.97     
Total input tokens:                      131072    
Total input text tokens:                 131072    
Total generated tokens:                  131072    
Total generated tokens (retokenized):    130847    
Request throughput (req/s):              1.54      
Input token throughput (tok/s):          1579.71   
Output token throughput (tok/s):         1579.71   
Peak output token throughput (tok/s):    512.00    
Peak concurrent requests:                40        
Total token throughput (tok/s):          3159.41   
Concurrency:                             29.34     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   19016.18  
Median E2E Latency (ms):                 18127.51  
P90 E2E Latency (ms):                    22003.88  
P95 E2E Latency (ms):                    22833.71  
P99 E2E Latency (ms):                    25633.41  
---------------Time to First Token----------------
Mean TTFT (ms):                          1206.50   
Median TTFT (ms):                        571.32    
P90 TTFT (ms):                           3523.06   
P95 TTFT (ms):                           3618.29   
P99 TTFT (ms):                           3690.55   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.41     
Median TPOT (ms):                        16.86     
P90 TPOT (ms):                           20.42     
P95 TPOT (ms):                           21.48     
P99 TPOT (ms):                           22.26     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           65.54     
Median ITL (ms):                         66.15     
P90 ITL (ms):                            69.76     
P95 ITL (ms):                            72.32     
P99 ITL (ms):                            79.43     
Max ITL (ms):                            146.51    
==================================================
### finished=2026-09-09T09:57:51Z rc=0